{"pageProps":{"post":{"date":"Nov 4, 2018","title":"Parrot 4.3 Release Notes","slug":"2018-11-03-parrot-4-3-release-notes","author":"palinuro","content":"**Parrot 4.3 is now available for download.**\n\nThis release provides security and stability updates and is the starting point for our plan to develop an LTS edition of Parrot.\n\n&nbsp;\n\n### Our plans for Parrot LTS\n\nWe are working on a Parrot LTS branch, a long term support, release-based distribution to provide long term reliability to our users for all our architectures.\n  \nOur plans are to release it along side the next Debian stable release, which is planned for the next year.\n  \nWe will continue to provide a rolling release branch for the x86_64 architecture where to include all the major version updates for our tools and test all our new features.\n\nIn our vision LTS does not mean outdated. We believe that our LTS branch should follow the native release process of all the tools and system components that we include, and we will not keep outdated and unsupported package versions in the repo, but we are working on new build nodes to provide updated backports for all the supported software.\n\nOf course Parrot 4.3 is not LTS yet, but it was developed as a middle step to our final goal that we plan to reach within the next summer.\n\n### \n\n### Linux 4.18\n\nLinux was updated to the 4.18.10 version, and linux 4.19 will be released soon.\n\n### Firefox 63\n\nFirefox 63 provides noticeable security and privacy features, but it is no longer available to 32bit systems, so we switched to firefox-esr on all the unsupported architectures.\n\n### Wine menu\n\nWe fixed a bug in the parrot menu configuration that prevented several menu categories to show up.\n  \nThis fixed the missing wine menu bug, which is now back again.\n\n### Bashrc updates\n\nThe Parrot .bashrc file was updated, now it provides better snap support, the _ll_ alias now shows the size in a human readable format and it does no longer overwrite some global settings as it used to do before.\n\n### Java 11\n\nOpenJDK 11 is now the default java provider.\n\n### Anonsurf\n\nAnonsurf received important stability upgrades and now it does not mess up the dns configuration.\n\n### New Parrot icons\n\nThe Parrot edition of the MAIA icon theme was updated.\n  \nWe dropped many old unused icons and replaced them with newer ones.\n\n### Core updates\n\nParrot 4.3 provides the latest updates of Debian Testing and many improvements to our sandbox system, in fact both firejail and apparmor received significant updates, and now the whole system is smoother, more secure and more reliable.\n\n&nbsp;\n\n## Download\n\n[Download Parrot 4.3](https://www.parrotsec.org/download.php)\n\n&nbsp;\n\n## Upgrade from a previous version\n\n> sudo full-upgrade\n\nor\n\n> sudo apt update\n  \n> sudo apt full-upgrade\n\n&nbsp;\n\n### Experimental KDE editon\n\nWe released an experimental home edition featuring the KDE Plasma desktop environment.\n\nWe will include in in our download pages as soon as it becomes reliable enough.\n\nMeanwhile you can manually download it from <https://archive.parrotsec.org/parrot/iso/4.3>\n\n&nbsp;\n\n**The following is a short list of some of the most relevant tool updates we included in this release:**\n\n* aircrack 1.3 -> 1.4\n  \n* airgeddon 8.11 -> 8.12\n  \n* anonsurf 2.8.1\n  \n* armitage 2015-08-13 -> 2016-07-09\n  \n* bettercap 2.8 -> 2.10\n  \n* dradis 3.9 -> 3.10\n  \n* fern-wifi-cracker 2.6 -> 2.7\n  \n* fping 4.0 -> 4.1\n  \n* netsniff-ng 0.6.4 -> 0.6.5\n  \n* faraday ide 3.0.1 -> 3.2\n  \n* radare2 2.8.0 -> 3.0.1\n  \n* sqlmap 1.2.8 -> 1.2.10\n  \n* sslscan 1.11.11 -> 1.11.12\n  \n* stunnel4 5.48 -> 5.49\n  \n* t50 5.7.1 -> 5.8.2\n  \n* theharvester 2.7.2 -> 3.0\n  \n* tor 0.3.3 -> 0.3.4\n  \n* tshark 2.6.3 -> 2.6.4\n  \n* wapiti 2.3.0 -> 3.0.1\n  \n* weevely 3.6.2 -> 3.7.0\n  \n* wireshark 2.6.3 -> 2.6.4\n  \n* wpscan 2.9.4 -> 3.3.2","image":"/assets/blog/macaw-poly2.jpg","description":null}},"__N_SSG":true}