{"pageProps":{"post":{"date":"Jan 21, 2019","title":"Parrot 4.5 release notes","slug":"2019-01-21-parrot-4-5-release-notes","author":"palinuro","content":"\n\n## Parrot 4.5 development notes\n\nParrot 4.5 is officially released, and there are some major changes under the hood.\n\n\n&nbsp;\n\n<a href=\"https://www.parrotsec.org/download-home.php\">\n![Parrot 4.5 download](../img/parrot-4.5-download.jpg)\n</a>\n\n&nbsp;\n\n\n## Dropped 32bit architecture images\n\nWe are in 2019 now,  and computers that are not capable of running 64bit and complex applications operating system are mostly old, legacy computers. To add to that, many programs and frameworks are no longer available for 32bit x86 systems.\n\n![Old crap](../img/parrot-4.5-old-crap-pc.jpg)\n\nWe have released 32bit (i386 Architecture) images since the beginning of the project, and we worked hard to provide fresh binary updates for the i386 architecture for a long time; However, 32bit-only computers are no longer capable of running a full pentest campaign or providing hardware-accelerated support to our security protection systems.\n\nParrot 4.5 no longer provides any live ISO files for the i386 architecture, even if it is still supported by our repository and our netinstall images. We are slowly planning to drop support for it in the future.\n\nNOTE: 32bit deprecation does not affect our ARM support, and armhf architecture is still fully supported.\n\n\n&nbsp;\n\n&nbsp;\n\n\n## Virtual Appliances\n\nWe released official docker templates for parrot many months ago, and they proved to be a turnkey solution to bring a full parrot pentest stack on top of any operating system supported by docker.\n\n![virtual appliance](../img/parrot-4.5-virtualbox-ova.png)\n\nThe next step that comes with Parrot 4.5 is the release of desktop virtual appliances in the OVA format that can be imported in VirtualBox, VMWare and other famous virtualization environments.\n\nThese virtual environments are still experimental, and even if they are the perfect solution to give Parrot a try and experiment with it, we still recommend a full custom installation from the ISO files for best chances of being supported and easier configuration and troubleshooting.\n\n&nbsp;\n\n&nbsp;\n\n## Linux 4.19\n\nLinux 4.19 is the default kernel in Parrot 4.5, and this new kernel version was already packaged by following our new kernel distribution policy implemented for Parrot 5.0 LTS.\n\n![linux 4.19](../img/parrot-4.5-linux-4.19.jpg)\n\nWe plan to support 2 kernel branches, a stable kernel and a testing kernel, and provide updates for both. Linux 4.19 is part of our testing branch, while the first release of the stable branch will be released with Parrot 5.0 itself.\n\nRead the full PSC [here - https://nest.parrotsec.org/parrot-organization/parrot-standards-codex/issues/2](https://nest.parrotsec.org/parrot-organization/parrot-standards-codex/issues/2). \n\n&nbsp;\n\n&nbsp;\n\n## Metasploit 5.0  \n\n![metasploit 5](../img/parrot-4.5-metasploit-5.jpg)\n\\\nMetasploit 5.0 was released with many new important features that we immediately imported and tested for our users.\n\nWe absolutely loved the new evasion modules, the opportunity to write shellcode in C, the new search engine, the integrated web services or the json-rpc daemon, and we wanted to offer quick access to this awesome framework through this new Parrot release.\n\n&nbsp;\n\n&nbsp;\n\n## Better Dev Tools\n\nWe improved our metapackages for developers, and setting up an advanced development environment for several programming languages and frameworks is now easier than ever:\n\n&nbsp;\n\n&nbsp;\n\n### parrot-devel\n\nIt is pre-installed in Parrot 4.5 and provides the following tools:\n\n* vscodium - an advanced and extensible text editor.\n* zeal - an offline documentation downloader and browser.\n* git-cola - a graphic client to GIT.\n* meld - a graphic patch inspector.\n* tora - a graphic database frontend compatible with several database backends.\n\nThese packages are included in the metapackage by using the \"Recommends\" apt directive, and they can be removed individually without triggering the removal of the whole parrot-devel metapackage.\n\nThe metapackage also recommends the installation of parrot-devel-tools.\n\n```\nsudo apt update\nsudo apt install parrot-devel\n```\n\n&nbsp;\n\n\n### parrot-devel-tools\n\nIt is recommended by parrot-devel and pre-installed in Parrot Security.\nIt provides some useful compilers and interpreters for the most used languages and provides the following packages:\n\n* GCC/G++ - a compiler collection for C, C++ and other languages.\n* python3 - the cpython interpreter for the python 3.6 and 3.7 language.\n* ruby - the official ruby lang interpreter and basic toolkit (includes irb and ri as well).\n\nThe package also recommends the following packages, that can be safely removed without triggering the removal of the entire parrot-devel-tools metapackage:\n\n* default-jdk - the latest Java OpenJDK distribution for Java 11 (both JDK and JRE).\n* cython3 - a compiler for the cython language, a strongly-typed dialect of python for efficient code.\n* rust/cargo - the rust compiler and devel tools and its package management system.\n* valac - the vala c compiler.\n* mono-devel - the development tools for the MONO framework, an open source implementation of .net.\n* mono-runtime - the runtime of the MONO framework compatible and interoperable with the latest .net runtime.\n* php-cli - the PHP 7.3 language plus its command line interface and some useful core libraries.\n* perl6 - the PERL 6 interpreter and core libraries.\n```\nsudo apt update\nsudo apt install parrot-devel-tools\n```\n&nbsp;\n\n\n### parrot-devel-extra\n\nThe parrot-devel-extra metapackage is a quick way to install many additional development utilities like advanced IDEs, additional languages, debuggers and extra tools.\n\n* golang - go language compiler and runtime\n* nodejs - node.js framework\n* npm - node.js package manager\n* atom - advanced and extensible editor by github\n* qtcreator - powerful C, C++ and Qt/QML IDE and debugger.\n* kdevelop - advanced general purpose IDE by KDE.\n* edb-debugger - graphical debugger.\n* jad - Java decompiler.\n* nasm - powerful general purpose x86 assembler.\n* radare2 - advanced command line hexadecimal editor.\n* cmake - cross-platform, open-source make system.\n* valgrind - nstrumentation framework for building dynamic analysis tools.\n* devscripts/build-essential - useful development utilities for debian developers/maintainers.\n\n```\nsudo apt update\nsudo apt install parrot-devel-extra\n```\n\n&nbsp;\n\n&nbsp;\n\n## Other updates\n\nMany more updates were imported since we are currently based on Debian testing, and we included all the latest updates, security patches and new features as usual.\n\n\n\n\n","image":"/assets/blog/macaw-poly2.jpg","description":null}},"__N_SSG":true}