{"pageProps":{"post":{"date":"Nov 6, 2019","title":"The Parrot Project needs your help","slug":"2019-11-06-the-parrot-project-needs-your-help","author":"marafed","content":"\n## The Parrot Project needs your help! \n\nWe need your help to going through our work. Giving such a complex service to millions of people all around the world requires a huge infrastructure; and, as you can imagine, ours cannot be self-hosted on a cheap VPS. \nWe do not track you in any way, and we do not exploit your data to make money, and we never will do. \nWe need your support to assure you the service at its best. \nDonate today and be part of the change! \n\n## More about our infrastructure… \n\nTo grant the highest level of privacy to our users, the entire insfrastructure is hosted on dedicated servers.  Although we have a vast network of mirrors, the central network needs significant resources to be able to correctly redirect to the correct mirror, avoid any censorship in countries with limitations and guarantee security updates in a very short time. Over the years we have even developed our own CDN service (have a look here: https://docs.parrotlinux.org/weathermap/), to have more control over the infrastructure and not allow third parties to read and tamper with traffic.\n\nThe archive only requires multiple nodes of at least 1 TB of storage each, the overall infrastructure receives more than 500 requests per second, the Redis service requires at least 24GB of RAM per node for the correct redirection of resources, and, despite everything, we can keep the costs of this infrastructure lower than impossible.\n\nWe are lucky to be a huge community, but from this community the number of donors is very low, at the moment it amounts to 33 in total, for a system that is used by hundreds of thousands of people in the world.\n\nCurrently, with the donations we receive, developers (who contribute purely on a voluntary basis, without any kind of remuneration) are forced to self tax themselves to keep the machines that are the foundations of our structure standing.\n\n## How to contribute\n\nIf you want to give your contribution to the project, head on our donations page and feel free to become a stable sponsor via Patreon, or send your one-shot contribution via PayPal.\n\nWe also love Cryptocurrencies, and Bitcoin, Litecoin, Ethereum, Stellar Lumens and other cryptocurrencies are more than welcome.\n\n[Donations Page](https://docs.parrotlinux.org/donate)\n\n\nKeep Pwning!\n","image":"/assets/blog/macaw-vaporwave.jpg","description":null}},"__N_SSG":true}