{"pageProps":{"post":{"date":"Sep 18, 2019","title":"Parrot 4.7 release notes","slug":"2019-09-18-parrot-4-7-release-notes","author":"palinuro","content":"\n# Parrot 4.7 development notes\n\nWe are proud to announce the release of Parrot 4.7, which represents an important step forward for our project.\n\n# How to update\n\nDownload the latest release from our [official download page](https://www.parrotlinux.org/download.php)\n\nUpdate your existing Parrot system with the following command\n\n```bash\nsudo parrot-upgrade\n```\n\nOr use the raw apt command\n\n```bash\nsudo apt update\nsudo apt full-upgrade\n```\n\nDon't forget to use this command regularly (at least once a week) to receive the latest security updates and bugfixes from the Parrot repository.\n\n---\n\n# Domain changes\n\nTo reflect the neutrality of a distro that started as a pentest-only system and became more general purpose later with Parro Home, the community voted through a democratic process to switch to parrotlinux.org as the new default domain of the project.\n\nWe will still use parrotsec.org for other things (included the old email addresses), and we introduced other project domains to handle specific parts of the infrastructure.\n\n# Repository changes\n\nWe are preparing to integrate a future LTS branch, so we decided to rename the current repository from stable to rolling.\nNothing changes for the end user, and the current Parrot branch will continue to behave the same as before, but now with a different name to better reflect the rolling release nature of the system, waiting for the LTS edition to join the Parrot OS family along side the rolling branch in a similar way OpenSUSE does.\n\n# New menu structure and tools improvements\n\nThe pentesting menu structure was refactored and re-designed to make tools easier to access in a more logical hierarchical structure.\nNew tools were also added to the project, and we plan to add even more in the future. Not all of them are going to be pre-installed, but a good set of tools in our repository enables pentesters to build up the perfect pentest system for their specific needs, regardless the default package selection picked by our team.\n\n# New sandbox behavior (opt-in rather than opt-out)\n\nSandboxing is a great thing, and we were in the first line when we introduced our custom firejail+apparmor solution for the first time many years ago.\nWe still want to improve such feature and we have a whole team dedicated to improve sandboxing and hardening of the Parrot system, but we had to face the many users with issues caused by the restrictions of our sandbox.\n\nIn Parrot 4.7 the sandbox is disabled by default, and users can decide wether to start an application sandboxed or not. You can easily start the sandboxed version of an installed program from the /sandbox/ folder or from a dedicated menu that we plan to improve in the future (meanwhile the search feature of the bottom menu will fit all your needs), or you can re-enable it by default by using the `firecfg` tool.\n\n# Latest Linux 5.2\n\nThe new ISO files of Parrot 4.7 are being released only now, but we were the first Debian derivative distribution to introduce Linux 5.1 and 5.2 to all our users, and now we are ready to offer it also with our ISO files rebild cycle to support more devices and integrate all the latest linux features from the beginning.\n\n# New MATE 1.22 release\n\nParrot 4.7 ships with the latest MATE 1.22 desktop environment.\n\n# Miscellaneous\n\nNew firefox 69, the latest radare2 and cutter versions and many other important upgrades are all aboard as expected in a properly developed rolling release distro.\n","image":"/assets/blog/macaw-poly2.jpg","description":null}},"__N_SSG":true}