{"pageProps":{"post":{"date":"Mar 20, 2020","title":"Parrot 4.8 Release Notes","slug":"2020-03-20-parrot-4.8-release-notes","author":"palinuro","content":"\n# Parrot 4.8 is here\n\nParrot is based on Debian Testing, meaning that Parrot 4.8 includes all the updates that landed in the Debian testing repository between september 2019 and march 2020\n\nSome noticeable updates include:\n\n* linux 5.4\n* mate 1.24\n* revision of the sandbox\n* updated anonsurf\n* aircrack 1.6\n* airgeddon 10.01\n* beef 0.5.0\n* burpsuote 2020.1\n* vscodium 1.43\n* libreoffice 6.4 (base was removed)\n* metasploit 5.0.74 (updates will be released soon)\n* nodejs 10.17\n* postgresql 11\n* radare2 4.2\n* radare-cutter 1.10 (ghidra support coming soon)\n* weevely 4.0\n* wine 5.0\n\nand many many other updates.\n\n# Docker updates\n\nWe wanted to stress the importance of containers and Parrot as a Service, since we want anyone to be able to use the Parrot tools on their favorite desktop OS or in the cloud.\n\nnow we offer the following docker containrs that can be run on any docker-supported operating system:\n\n* parrotsec/core\n* parrosec/security\n* parrotsec/tools-nmap\n* parrotsec/tools-metasploit\n* parrotsec/tools-metasploit\n* parrotsec/tools-beef\n* parrotsec/tools-bettercap\n* parrotsec/tools-sqlmap\n\n\nA detailed description of the whole Parrot for docker project, the available containers, their usage and a quick reference is available [here](https://nest.parrot.sh/build/docker-images/-/blob/master/README.md)\n\n\n# New Team Workflow\n\nParrot 4.8 is an important release after months since the last major update.\n\nThe Parrot team wanted to spend a lot of time re-organizing its internal structure, from the operations and workflow of developers, up to the infrastructure.\n\nAfter such a huge work, we have finally moved to the new workflow, and Parrot 4.8 is the proof of how hard we wanted such changes to take place in the project and how smooth development and cooperation became after achieving this goal.\n\n\n","image":"/assets/blog/macaw-poly2.jpg","description":"Parrot 4.8 is now available for download, read the release notes"}},"__N_SSG":true}