{"pageProps":{"post":{"date":"Mar 28, 2021","title":"Parrot 4.11 Release Notes","slug":"2021-03-28-parrot-4.11-release-notes","author":"palinuro","content":"\nWe are proud to announce the release of Parrot OS 4.11.\nThis new version includes many important updates to make the distribution more reliable and more secure.\n\n# Where to get it\n\nYou can download Parrot OS from our [official download page](https://parrotsec.org/download), and we invite you to never trust third party and unofficial sources.\n\nWe also provide official torrent files in case direct downloads don't work for you.\n\n# How to upgrade from a previous version\n\nParrot OS is a rolling release distribution, and updates flow in the repo as soon as they prove to be stable and reliable.\n\nVersion numbers (like 4.10 or 4.11) are just tags that we assign to the current state of the project every time we think there are enough updates accumulated in the repo to justify a refresh of the ISO files. In fact every Parrot version represents exactly a refresh of our ISO files to collect all the updates together into something ready to install and properly tested.\n\nYou can upgrade an existing system via APT using one of the following commands:\n\n`sudo parrot-upgrade`\n\nor\n\n`sudo apt update && sudo apt full-upgrade`\n\nbut we recommend to do a backup and re-install the latest version to have a cleaner and more reliable user experience, especially if you come from a very old version of parrot that were not updated for a long while.e\n\n# What's new\n\n## Debian freezing and LTS plans\n\nDebian is in “feature freeze” state to prepare for the new stable release.\nParrot 4.11 will benefit from this, and all the updates from now on will be subject to more tests.\n\nWe will catch the opportunity of a new Debian release to convert the current branch into a Long Term Support branch with fewer updates for a very reliable user experience.\nThe Long Term Support conversion plan will also re-introduce ARM support and init freedom.\n\nWe are evaluating the idea of continuing to provide a Rolling Release branch along side the LTS one.\n\n## Important updates\n\nLinux 5.10 is the default kernel of this new Parrot version, with better hardware support for very recent hardware.\nWe plan to release Linux 5.11 as soon as possible as a later update.\n\nWe have finally purged many old, broken and unmaintained tools, and revisited many of the existing ones. Our tool metapackages were revisited as well to reflect this little revolution.\nParrot 4.11 provides cleaner metapackages, updated tools and a more consistent repository.\n\nPrevious Parrot versions used to have un-needed services shut down by default, but such services happened to re-enable randomly after system updates. We have enforced some systemd rules to prevent this happening.\n\nCertain tools used for Linux local privilege escalation represented a security hazard for parrot, so we have disabled and unarmed them (i.e. xspy is no longer an executable file in /usr/bin).\n\n\n## Alternate Editions\n\nKde Plasma now works again as expected, and it was updated to provide a better look and feel.\n\nXFCE has been updated with several improvements and fixes.\n\n## Noticeable updates for pentesters\n\nMetasploit framework was updated to 6.0.36, and we keep updating it weekly.\n\nBettercap has finally been updated to 2.29, and 2.30 is coming very soon.\n\nPompem was patched from Parrot team to properly handle down services and use the new wpvulndb server.\n\nRoutersploit was updated to make it work with python 3.9.\n\nXspy was patched to not be executable on host system.\n\nFish and Zsh support is now available in our skel, including the latest zsh-autocomplete version.\n\n\nWe can't report all the updates done to our tools here. If you are interested in a particular package, please read its specific changelog in /usr/share/doc/packagename to know more.\n\n\n## Noticeable updates for developers\n\nVSCodium, the open-source binary distribution of VSCode with telemetry removed at source level, is still our default development tool, and it was updated to its latest version (1.54). Geany (with some Parrot customizations) is also pre-installed for those running on less powerful hardware.\n\nParrot now ships with Python 3.9. Python 2 is finally deprecated, and /usr/bin/python now points to /usr/bin/python3 by default.\n\nParrot also includes Go 1.15, and Go 1.16 will come very soon.\n\nThe default Gcc version is  10.2.1.\n\nOpen a terminal window, type sudo apt show parrot-devel- and press TAB a couple of times to get the list of available packages from the bash autocompletion.\n\nComplete the command with the package of your choice to know more about the features delivered (i.e. apt show parrot-devel-golang).\n\nAdditional metapackages for developers will come soon.\n\n\n\n## Other updates from upstream providers\n\nAs always, this version ships with all the latest updates from our upstream sources (mostly Debian), and every new fix, improvement (or bug) is now included in Parrot 4.11 as well.\n\nFrom the firefox browser to the mate desktop environment, all the awesome upates and security fixes from upstream sources since the previous release are now part of the Parrot repository and hence part of this new release.\n\n\n\n\n\n\nHappy hacking\n","image":"/assets/blog/4.11/parrot-4.11.jpg","description":"Parrot 4.11 is now available for download, read the release notes"}},"__N_SSG":true}