{"pageProps":{"post":{"date":"Sep 29, 2022","title":"Parrot 5.1 Release Notes","slug":"2022-09-24-parrot-5.1-release-notes","author":"palinuro","content":"\n[](/public/assets/blog/5.1/parrot-5.1.png)\n\n# Parrot 5.1 Release Notes\nParrot OS 5.1 is officially released.\nWe're proud to say that the new version of Parrot OS 5.1 is available for download; this new version includes a lot of improvements and updates that makes the distribution more performing and more secure.\n\n## How do I get Parrot OS?\n\nYou can download Parrot OS by clicking [here](http://parrotsec.org/download) and, as always, we invite you to never trust third part and unofficial sources.\n\nIf you need any help or in case the direct downloads don't work for you, we also provide official Torrent files, which can circumvent firewalls and network restrictions in most cases.\n\n## How do I upgrade from a previous version?\n\nFirst of all, we always suggest to update your version for being sure that is stable and functional.\nYou can upgrade an existing system via APT using one of the following commands:\n\n\n* `sudo parrot-upgrade`\n\nor\n\n* `sudo apt update && sudo apt full-upgrade`\n\nEven if we recommend to always update your version, it is also recommended to do a backup and re-install the latest version to have a cleaner and more reliable user experience, especially if you upgrade from a very old version of parrot.\n\n# What's new in Parrot OS 5.1\n\n\n## New kernel 5.18.\n\nYou can find all the infos about the new Kernel 5.18 by clickig on this [link](https://kernelnewbies.org/Linux_5.18#fprobe.2C_for_probing_multiple_functions_with_a_single_probe_handler).\n\n## Updated docker containers\n\nOur docker offering has been revamped!\nWe now provide our dedicated **parrot.run** image registry along with the default **docker.io** one.\n\nAll our images are now natively multiarch, and support amd64 and arm64 architectures.\n\nOur containers offering was updated as well, and we are committed to further improve it.\n\nRun `docker run --rm -ti --network host -v $PWD/work:/work parrot.run/core` and give our containers a try without having to install the system, or visit our [Docker images page](https://docs.parrotsec.org/docs/cloud/parrot-on-docker) to explore the other containers we offer.\n\n## Updated backports.\n\nSeveral packages were updated and backported, like the new Golang 1.19 or Libreoffice 7.4. This is part of our commitment to provide the latest version of every most important software while choosing a stable LTS release model.\n\nTo make sure to have all the latest packages installed from our backports channel, use the following commands:\n\n* `sudo apt update`\n* `sudo apt full-upgrade -t parrot-backports`\n\n## System updates\n\nThe system has received important updates to some opf its key packages, like parrot-menu, which now provides additional launchers to our newly imported tools; or parrot-core, which now provides a new firefox profile with improved security hardening, plus some minor bugfixes to our zshrc configuration.\n\n## Firefox profile overhault\n\nAs mentioned earlier, our Firefox profile has received a major update that significantly improves the overall privacy and security.\n\nOur bookmarks collection has been revamped, and now includes new resources, including OSINT services, new learning sources and other useful resources for hackers, developers, students and security researchers.\n\nWe have also boosted our effort to avoid Mozilla telemetry and bring DuckDuckGo back as the default search engine, while we are exploring other alternatives for the future.\n\n## Tools updates\n\nMost of our tools have received major version updates, especially our reverse engineering tools, like rizin and rizin-cutter.\n\nImportant updates involved metasploit, exploitdb and other popular tools as well.\n\n\n## New AnonSurf 4.0\n\nThe new AnonSurf 4 represents a major upgrade for our popular anonymity tool.\n\nAnonsurf is our in-house anonymity solution that routes all the system traffic through TOR automatically without having to set up proxy settings for each individua program, and preventing traffic leaking in most cases.\n\nThe new version provides significant fixes and reliability updates, fully supports debian systems without the old resolvconf setup, has a new user interface with improved system tray icon and settings dialog window, and offers a better overall user experience.\n\n\n## Parrot IoT improvements\n\nOur IoT version now implements significant performance improvements for the various Raspberry Pi boards, and finally includes Wi-Fi support for the Raspberry Pi 400 board.\n\nThe Parrot IoT offering has also been expanded, and it now offers Home and Security editions as well, with a full MATE desktop environment exactly like the desktop counterpart.\n\n\n## Architect Edition improvements\n\nOur popular Architect Edition now implements some minor bugfixes and is more reliable than ever.\n\nThe Architect Edition is a special edition of Parrot that enables the user to install a barebone Parrot Core system, and then offers a selection of additional modules to further customize the system.\n\nYou can use Parrot Architect to install other desktop environments like KDE, GNOME or XFCE, or to install a specific selection of tools.\n\n## New infrastructure powered by Parrot and Kubernetes\n\nThe Architect Edition is also used internally by the Parrot Engineering Team to install Parrot Server Edition on all the servers that power our infrastructure, which is officially 100% powered by Parrot and Kubernetes.\n\nThis is a major change in the way we handle our infrastructure, which enables us to implement better autoscaling, easier management, smaller attack surface and an overall better network, with the improved scalability and security we were looking for.","image":"/assets/blog/5.1/parrot-5.1.png","description":"We're proud to say that the new version of Parrot OS 5.1 is available for download."}},"__N_SSG":true}